[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:2:38
 class Item {
-  constructor(name, sellIn, quality) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-  }
+  constructor(name, sellIn, quality) {}
 }
 
killedBy: Gilded Rose should foo
statusReason: expected undefined to equal 'foo'

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:10:27
 }
 
 class Shop {
-  constructor(items = []) {
-    this.items = items;
-  }
+  constructor(items = []) {}
 
   updateQuality() {
killedBy: Gilded Rose should foo
statusReason: Cannot read property 'length' of undefined

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:15:49
   }
 
   updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-        this.doDailyQualityDecrease(i);
-      } else {
-        this.doDailyQualityIncrease(i);
-      }
-      if (this.items[i].name == "Conjured") {
-        this.doDailyQualityDecrease(i);
-      }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.doDailySellInDecrease(i);
-      }
-      if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            this.doubleQualityDecrease(i);
-          } else {
-            this.zeroOutBackstagePassQuality(i);
-          }
-        } else {
-          this.increaseBrieQuality(i);
-        }
-      }
-    }
+    for (var i = 0; i < this.items.length; i++) {}
 
     return this.items;
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:15:21
   }
 
   updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
+    for (var i = 0; i <= this.items.length; i++) {
       if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
         this.doDailyQualityDecrease(i);
killedBy: Gilded Rose should foo
statusReason: Cannot read property 'name' of undefined

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:16:115
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-        this.doDailyQualityDecrease(i);
-      } else {
+      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {} else {
         this.doDailyQualityIncrease(i);
       }
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:16:11
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
+      if (this.items[i].name == "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
         this.doDailyQualityDecrease(i);
       } else {
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 2 to equal 0

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:18:14
     for (var i = 0; i < this.items.length; i++) {
       if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
         this.doDailyQualityDecrease(i);
-      } else {
-        this.doDailyQualityIncrease(i);
-      }
+      } else {}
       if (this.items[i].name == "Conjured") {
         this.doDailyQualityDecrease(i);
killedBy: Gilded Rose should update +1 quality for Aged Brie
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:21:11
       } else {
         this.doDailyQualityIncrease(i);
       }
-      if (this.items[i].name == "Conjured") {
+      if (false) {
         this.doDailyQualityDecrease(i);
       }
killedBy: Gilded Rose should degrad Conjured items in Quality twice as fast as normal items when sell in is positive
statusReason: expected 19 to equal 18

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:21:11
       } else {
         this.doDailyQualityIncrease(i);
       }
-      if (this.items[i].name == "Conjured") {
+      if (this.items[i].name != "Conjured") {
         this.doDailyQualityDecrease(i);
       }
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 0 to equal 1

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:24:11
       if (this.items[i].name == "Conjured") {
         this.doDailyQualityDecrease(i);
       }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+      if (this.items[i].name == "Sulfuras, Hand of Ragnaros") {
         this.doDailySellInDecrease(i);
       }
killedBy: Gilded Rose should update +1 quality and -1 sell in for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 10 to equal 9

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:24:63
       if (this.items[i].name == "Conjured") {
         this.doDailyQualityDecrease(i);
       }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.doDailySellInDecrease(i);
-      }
+      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {}
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
killedBy: Gilded Rose should update +1 quality and -1 sell in for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:27:11
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.doDailySellInDecrease(i);
       }
-      if (this.items[i].sellIn < 0) {
+      if (true) {
         if (this.items[i].name != "Aged Brie") {
           if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 0 to equal 1

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:28:13
         this.doDailySellInDecrease(i);
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
+        if (this.items[i].name == "Aged Brie") {
           if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
             this.doubleQualityDecrease(i);
killedBy: Gilded Rose should update -1 quality for non-brie, non-pass, non-sulfuras that has negative sell in and positive quality
statusReason: expected 1 to equal 0

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:29:15
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
+          if (true) {
             this.doubleQualityDecrease(i);
           } else {
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality to 0 if it has negative sell in
statusReason: expected 99 to equal 0

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:29:82
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            this.doubleQualityDecrease(i);
-          } else {
+          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {} else {
             this.zeroOutBackstagePassQuality(i);
           }
killedBy: Gilded Rose should update non-brie, non-pass that has negative sell in and positive quality with -1 quality two times
statusReason: expected 2 to equal 1

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:31:18
         if (this.items[i].name != "Aged Brie") {
           if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
             this.doubleQualityDecrease(i);
-          } else {
-            this.zeroOutBackstagePassQuality(i);
-          }
+          } else {}
         } else {
           this.increaseBrieQuality(i);
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality to 0 if it has negative sell in
statusReason: expected 100 to equal 0

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:34:16
           } else {
             this.zeroOutBackstagePassQuality(i);
           }
-        } else {
-          this.increaseBrieQuality(i);
-        }
+        } else {}
       }
     }
killedBy: Gilded Rose should update Aged Brie with negative sell in and quality under 47 two times
statusReason: expected 48 to equal 49

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:43:26
     return this.items;
   }
 
-  increaseBrieQuality(i) {
-    if (this.items[i].quality < 50) {
-      this.items[i].quality = this.items[i].quality + 1;
-    }
-  }
+  increaseBrieQuality(i) {}
 
   zeroOutBackstagePassQuality(i) {
killedBy: Gilded Rose should update Aged Brie with negative sell in and quality under 47 two times
statusReason: expected 48 to equal 49

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:44:9
   }
 
   increaseBrieQuality(i) {
-    if (this.items[i].quality < 50) {
+    if (this.items[i].quality >= 50) {
       this.items[i].quality = this.items[i].quality + 1;
     }
killedBy: Gilded Rose should update Aged Brie quality +1 if it has negative sell in and quality under 50
statusReason: expected 51 to equal 50

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:44:37
   }
 
   increaseBrieQuality(i) {
-    if (this.items[i].quality < 50) {
-      this.items[i].quality = this.items[i].quality + 1;
-    }
+    if (this.items[i].quality < 50) {}
   }
 
killedBy: Gilded Rose should update Aged Brie with negative sell in and quality under 47 two times
statusReason: expected 48 to equal 49

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:49:34
     }
   }
 
-  zeroOutBackstagePassQuality(i) {
-    this.items[i].quality = this.items[i].quality - this.items[i].quality;
-  }
+  zeroOutBackstagePassQuality(i) {}
 
   doubleQualityDecrease(i) {
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality to 0 if it has negative sell in
statusReason: expected 100 to equal 0

[Killed] ArithmeticOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:50:29
   }
 
   zeroOutBackstagePassQuality(i) {
-    this.items[i].quality = this.items[i].quality - this.items[i].quality;
+    this.items[i].quality = this.items[i].quality + this.items[i].quality;
   }
 
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality to 0 if it has negative sell in
statusReason: expected 200 to equal 0

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:53:28
     this.items[i].quality = this.items[i].quality - this.items[i].quality;
   }
 
-  doubleQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.items[i].quality = this.items[i].quality - 1;
-      }
-      if (this.items[i].name == "Conjured") {
-        this.items[i].quality = this.items[i].quality - 1;
-      }
-    }
-  }
+  doubleQualityDecrease(i) {}
 
   doDailySellInDecrease(i) {
killedBy: Gilded Rose should update non-brie, non-pass that has negative sell in and positive quality with -1 quality two times
statusReason: expected 2 to equal 1

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:54:36
   }
 
   doubleQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.items[i].quality = this.items[i].quality - 1;
-      }
-      if (this.items[i].name == "Conjured") {
-        this.items[i].quality = this.items[i].quality - 1;
-      }
-    }
+    if (this.items[i].quality > 0) {}
   }
 
killedBy: Gilded Rose should update non-brie, non-pass that has negative sell in and positive quality with -1 quality two times
statusReason: expected 2 to equal 1

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:54:9
   }
 
   doubleQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
+    if (this.items[i].quality >= 0) {
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose should update -1 quality for non-brie, non-pass, non-sulfuras that has negative sell in and positive quality
statusReason: expected -1 to equal 0

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:58:11
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].quality = this.items[i].quality - 1;
       }
-      if (this.items[i].name == "Conjured") {
+      if (true) {
         this.items[i].quality = this.items[i].quality - 1;
       }
killedBy: Gilded Rose should update non-brie, non-pass that has negative sell in and positive quality with -1 quality two times
statusReason: expected 0 to equal 1

[Killed] ArithmeticOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:59:33
         this.items[i].quality = this.items[i].quality - 1;
       }
       if (this.items[i].name == "Conjured") {
-        this.items[i].quality = this.items[i].quality - 1;
+        this.items[i].quality = this.items[i].quality + 1;
       }
     }
killedBy: Gilded Rose should degrad Conjured items in Quality twice as fast as normal items when sell in is negative
statusReason: expected 18 to equal 16

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:64:28
     }
   }
 
-  doDailySellInDecrease(i) {
-    this.items[i].sellIn = this.items[i].sellIn - 1;
-  }
+  doDailySellInDecrease(i) {}
 
   doDailyQualityIncrease(i) {
killedBy: Gilded Rose should update +1 quality and -1 sell in for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 10 to equal 9

[Killed] ArithmeticOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:65:28
   }
 
   doDailySellInDecrease(i) {
-    this.items[i].sellIn = this.items[i].sellIn - 1;
+    this.items[i].sellIn = this.items[i].sellIn + 1;
   }
 
killedBy: Gilded Rose should update +1 quality and -1 sell in for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 11 to equal 9

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:68:29
     this.items[i].sellIn = this.items[i].sellIn - 1;
   }
 
-  doDailyQualityIncrease(i) {
-    if (this.items[i].quality < 50) {
-      this.items[i].quality = this.items[i].quality + 1;
-      if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-        this.increaseQualityForBackstagePass(i);
-      }
-    }
-  }
+  doDailyQualityIncrease(i) {}
 
   increaseQualityForBackstagePass(i) {
killedBy: Gilded Rose should update +1 quality for Aged Brie
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:69:9
   }
 
   doDailyQualityIncrease(i) {
-    if (this.items[i].quality < 50) {
+    if (false) {
       this.items[i].quality = this.items[i].quality + 1;
       if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
killedBy: Gilded Rose should update +1 quality for Aged Brie
statusReason: expected 49 to equal 50

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:69:9
   }
 
   doDailyQualityIncrease(i) {
-    if (this.items[i].quality < 50) {
+    if (this.items[i].quality >= 50) {
       this.items[i].quality = this.items[i].quality + 1;
       if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
killedBy: Gilded Rose should update +1 quality for Aged Brie
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:71:11
   doDailyQualityIncrease(i) {
     if (this.items[i].quality < 50) {
       this.items[i].quality = this.items[i].quality + 1;
-      if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
+      if (false) {
         this.increaseQualityForBackstagePass(i);
       }
killedBy: Gilded Rose should update +1 quality two times for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 49 to equal 50

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:71:78
   doDailyQualityIncrease(i) {
     if (this.items[i].quality < 50) {
       this.items[i].quality = this.items[i].quality + 1;
-      if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-        this.increaseQualityForBackstagePass(i);
-      }
+      if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {}
     }
   }
killedBy: Gilded Rose should update +1 quality two times for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 49 to equal 50

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:77:38
     }
   }
 
-  increaseQualityForBackstagePass(i) {
-    if (this.items[i].sellIn < 11) {
-      if (this.items[i].quality < 50) {
-        this.items[i].quality = this.items[i].quality + 1;
-      }
-    }
-    if (this.items[i].sellIn < 6) {
-      if (this.items[i].quality < 50) {
-        this.items[i].quality = this.items[i].quality + 1;
-      }
-    }
-  }
+  increaseQualityForBackstagePass(i) {}
 
   doDailyQualityDecrease(i) {
killedBy: Gilded Rose should update +1 quality two times for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:78:9
   }
 
   increaseQualityForBackstagePass(i) {
-    if (this.items[i].sellIn < 11) {
+    if (false) {
       if (this.items[i].quality < 50) {
         this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality +1 three times if it has sell in under 6 and quality under 50
statusReason: expected 5 to equal 6

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:78:36
   }
 
   increaseQualityForBackstagePass(i) {
-    if (this.items[i].sellIn < 11) {
-      if (this.items[i].quality < 50) {
-        this.items[i].quality = this.items[i].quality + 1;
-      }
-    }
+    if (this.items[i].sellIn < 11) {}
     if (this.items[i].sellIn < 6) {
       if (this.items[i].quality < 50) {
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality +1 three times if it has sell in under 6 and quality under 50
statusReason: expected 5 to equal 6

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:79:39
 
   increaseQualityForBackstagePass(i) {
     if (this.items[i].sellIn < 11) {
-      if (this.items[i].quality < 50) {
-        this.items[i].quality = this.items[i].quality + 1;
-      }
+      if (this.items[i].quality < 50) {}
     }
     if (this.items[i].sellIn < 6) {
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality +1 three times if it has sell in under 6 and quality under 50
statusReason: expected 5 to equal 6

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:79:11
 
   increaseQualityForBackstagePass(i) {
     if (this.items[i].sellIn < 11) {
-      if (this.items[i].quality < 50) {
+      if (true) {
         this.items[i].quality = this.items[i].quality + 1;
       }
killedBy: Gilded Rose should update +1 quality and -1 sell in for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 51 to equal 50

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:83:35
         this.items[i].quality = this.items[i].quality + 1;
       }
     }
-    if (this.items[i].sellIn < 6) {
-      if (this.items[i].quality < 50) {
-        this.items[i].quality = this.items[i].quality + 1;
-      }
-    }
+    if (this.items[i].sellIn < 6) {}
   }
 
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality +1 three times if it has sell in under 6 and quality under 50
statusReason: expected 5 to equal 6

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:84:11
       }
     }
     if (this.items[i].sellIn < 6) {
-      if (this.items[i].quality < 50) {
+      if (this.items[i].quality <= 50) {
         this.items[i].quality = this.items[i].quality + 1;
       }
killedBy: Gilded Rose should update +1 quality two times for Backstage passes to a TAFKAL80ETC concert
statusReason: expected 51 to equal 50

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:84:11
       }
     }
     if (this.items[i].sellIn < 6) {
-      if (this.items[i].quality < 50) {
+      if (false) {
         this.items[i].quality = this.items[i].quality + 1;
       }
killedBy: Gilded Rose should update Backstage passes to a TAFKAL80ETC concert quality +1 three times if it has sell in under 6 and quality under 50
statusReason: expected 5 to equal 6

[Killed] BlockStatement
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:90:29
     }
   }
 
-  doDailyQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.items[i].quality = this.items[i].quality - 1;
-      }
-    }
-  }
+  doDailyQualityDecrease(i) {}
 }
 
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:91:9
   }
 
   doDailyQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
+    if (false) {
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] EqualityOperator
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:91:9
   }
 
   doDailyQualityDecrease(i) {
-    if (this.items[i].quality > 0) {
+    if (this.items[i].quality <= 0) {
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] ConditionalExpression
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:92:11
 
   doDailyQualityDecrease(i) {
     if (this.items[i].quality > 0) {
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
+      if (false) {
         this.items[i].quality = this.items[i].quality - 1;
       }
killedBy: Gilded Rose should update -1 qualities for non-brie, non-pass, non-sulfuras
statusReason: expected 1 to equal 0

[Killed] ObjectLiteral
TDD/tdd-mooc-legacy-code/src/gilded_rose.js:99:18
   }
 }
 
-module.exports = {
-  Item,
-  Shop,
-};
+module.exports = {};
 
killedBy: Gilded Rose should foo
statusReason: Item is not a constructor
